In [7]:
import nbimporter
import pandas as pd
from collections import OrderedDict
import read_report_cobol as cobol_reader # type: ignore
import read_report_java as java_reader # type: ignore

def get_employee_types():
    employee_types = ['clt', 'autarquico']
    return employee_types

def get_common_table_types():
    table_types = ['apropriado', 'realizado']
    return table_types

cobol_file_path = "RHPP05LA.PDF"
java_file_path  = "RHPP05LA - GERAL.pdf"

results = {}

# lê os arquivos, adiciona a um dicionario e ordena as chaves
cobol_report = cobol_reader.get_cobol_data_from(cobol_file_path)
java_report = java_reader.get_java_data_from(java_file_path)
cobol_report = OrderedDict(sorted(cobol_report.items()))
java_report  = OrderedDict(sorted(java_report.items()))

# verifica se as chaves sao iguais e na mesma ordem
if list(cobol_report.keys()) == list(java_report.keys()):
    for (c_key, c_item), (j_key, j_item) in zip(cobol_report.items(), java_report.items()):
        for emp_type in get_employee_types():
            for tb_type in get_common_table_types():
                if emp_type == get_employee_types()[0] and tb_type == get_common_table_types()[0]:

                    display('Cobol', c_key, emp_type, tb_type, c_item[emp_type][tb_type])
                    display('Java', j_key, emp_type, tb_type, j_item[emp_type][tb_type])
                    
                    items = j_item[emp_type][tb_type].iloc[:,0]
                    df_j = j_item[emp_type][tb_type].iloc[:,1:].apply(pd.to_numeric, errors='coerce')
                    df_c = c_item[emp_type][tb_type].iloc[:,1:].apply(pd.to_numeric, errors='coerce')

                    df_diff = df_j - df_c
                    df_diff = pd.concat([items, df_diff], axis=1)

                    display('diferenca: (java) - (cobol)', df_diff, '------------')

else:
    print("Chaves diferentes entre os arquivos! Validar PDF.")

Leitura feita com sucesso...

'Cobol'

34240

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  121536.56  40512.20    162048.76  121536.56  283585.32
1            inss   20141.29   6713.74     26855.03   20141.29   46996.32
2         ac_trab     503.15    167.71       670.86     503.15    1174.01
3            fgts    8056.28   2685.46     10741.74    8056.28   18798.02
4       spprevcom       0.00      0.00         0.00    2244.59    2244.59
5  total_encargos   28700.72   9566.91     38267.63   30945.31   69212.94
6           total  150237.28  50079.11    200316.39  152481.87  352798.26

'Java'

34240

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  121836.58  40611.91    162448.49  121836.58  284285.07
1            inss   24366.90   8122.01     32488.91   20201.37   52690.28
2         ac_trab     608.73    202.60       811.33     504.62    1315.95
3            fgts    9746.40   3248.45     12994.85    8080.24   21075.09
4       spprevcom       0.00      0.00         0.00    2372.02    2372.02
5  total_encargos   34722.03  11573.06     46295.09   31158.25   77453.34
6           total  156558.61  52184.97    208743.58  152994.83  361738.41

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao   300.02      99.71        399.73      300.02   699.75
1            inss  4225.61    1408.27       5633.88       60.08  5693.96
2         ac_trab   105.58      34.89        140.47        1.47   141.94
3            fgts  1690.12     562.99       2253.11       23.96  2277.07
4       spprevcom     0.00       0.00          0.00      127.43   127.43
5  total_encargos  6021.31    2006.15       8027.46      212.94  8240.40
6           total  6321.33    2105.86       8427.19      512.96  8940.15

'------------'

'Cobol'

34241

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  158930.39  52976.78    211907.17  158930.39  370837.56
1            inss   24058.39   8019.41     32077.80   24058.39   56136.19
2         ac_trab     601.01    200.36       801.37     601.01    1402.38
3            fgts    9623.05   3207.70     12830.75    9623.05   22453.80
4       spprevcom       0.00      0.00         0.00    2946.95    2946.95
5  total_encargos   34282.45  11427.47     45709.92   37229.40   82939.32
6           total  193212.84  64404.25    257617.09  196159.79  453776.88

'Java'

34241

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  158929.86  52976.29    211906.15  158929.86  370836.01
1            inss   31785.49  10594.84     42380.33   24058.37   66438.70
2         ac_trab     794.13    264.33      1058.46     600.97    1659.43
3            fgts   12713.87   4237.59     16951.46    9623.04   26574.50
4       spprevcom       0.00      0.00         0.00    3713.30    3713.30
5  total_encargos   45293.49  15096.76     60390.25   37995.68   98385.93
6           total  204223.35  68073.05    272296.40  196925.54  469221.94

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.53      -0.49         -1.02       -0.53     -1.55
1            inss   7727.10    2575.43      10302.53       -0.02  10302.51
2         ac_trab    193.12      63.97        257.09       -0.04    257.05
3            fgts   3090.82    1029.89       4120.71       -0.01   4120.70
4       spprevcom      0.00       0.00          0.00      766.35    766.35
5  total_encargos  11011.04    3669.29      14680.33      766.28  15446.61
6           total  11010.51    3668.80      14679.31      765.75  15445.06

'------------'

'Cobol'

34262

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario      total
0     apropriacao  264702.30   88234.11    352936.41  264702.30  617638.71
1            inss   38345.90   12781.95     51127.85   38345.90   89473.75
2         ac_trab    2744.07     914.76      3658.83    2744.07    6402.90
3            fgts   15338.00    5112.70     20450.70   15338.00   35788.70
4       spprevcom       0.00       0.00         0.00    3048.88    3048.88
5  total_encargos   56427.97   18809.41     75237.38   59476.85  134714.23
6           total  321130.27  107043.52    428173.79  324179.15  752352.94

'Java'

34262

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario      total
0     apropriacao  264701.41   88233.25    352934.66  264701.41  617636.07
1            inss   52939.61   17646.03     70585.64   38345.85  108931.49
2         ac_trab    3788.61    1262.32      5050.93    2743.99    7794.92
3            fgts   21175.33    7057.89     28233.22   15337.90   43571.12
4       spprevcom       0.00       0.00         0.00    3227.92    3227.92
5  total_encargos   77903.55   25966.24    103869.79   59655.66  163525.45
6           total  342604.96  114199.49    456804.45  324357.07  781161.52

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.89      -0.86         -1.75       -0.89     -2.64
1            inss  14593.71    4864.08      19457.79       -0.05  19457.74
2         ac_trab   1044.54     347.56       1392.10       -0.08   1392.02
3            fgts   5837.33    1945.19       7782.52       -0.10   7782.42
4       spprevcom      0.00       0.00          0.00      179.04    179.04
5  total_encargos  21475.58    7156.83      28632.41      178.81  28811.22
6           total  21474.69    7155.97      28630.66      177.92  28808.58

'------------'

'Cobol'

34284

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario      total
0     apropriacao  266996.22   88998.79    355995.01  266996.22  622991.23
1            inss   38516.46   12838.77     51355.23   38516.46   89871.69
2         ac_trab     962.27     320.79      1283.06     962.27    2245.33
3            fgts   15406.11    5135.40     20541.51   15406.11   35947.62
4       spprevcom       0.00       0.00         0.00    4804.09    4804.09
5  total_encargos   54884.84   18294.96     73179.80   59688.93  132868.73
6           total  321881.06  107293.75    429174.81  326685.15  755859.96

'Java'

34284

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario      total
0     apropriacao  266995.46   88997.98    355993.44  266995.46  622988.90
1            inss   53398.40   17798.89     71197.29   38516.42  109713.71
2         ac_trab    1334.26     444.24      1778.50     962.20    2740.70
3            fgts   21358.88    7119.03     28477.91   15406.04   43883.95
4       spprevcom       0.00       0.00         0.00    5336.75    5336.75
5  total_encargos   76091.54   25362.16    101453.70   60221.41  161675.11
6           total  343087.00  114360.14    457447.14  327216.87  784664.01

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.76      -0.81         -1.57       -0.76     -2.33
1            inss  14881.94    4960.12      19842.06       -0.04  19842.02
2         ac_trab    371.99     123.45        495.44       -0.07    495.37
3            fgts   5952.77    1983.63       7936.40       -0.07   7936.33
4       spprevcom      0.00       0.00          0.00      532.66    532.66
5  total_encargos  21206.70    7067.20      28273.90      532.48  28806.38
6           total  21205.94    7066.39      28272.33      531.72  28804.05

'------------'

'Cobol'

34306

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  114899.33  38299.80    153199.13  114899.33  268098.46
1            inss   16478.44   5492.79     21971.23   16478.44   38449.67
2         ac_trab     411.59    137.15       548.74     411.59     960.33
3            fgts    6591.13   2197.11      8788.24    6591.13   15379.37
4       spprevcom       0.00      0.00         0.00     900.90     900.90
5  total_encargos   23481.16   7827.05     31308.21   24382.06   55690.27
6           total  138380.49  46126.85    184507.34  139281.39  323788.73

'Java'

34306

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  114898.89  38299.33    153198.22  114898.89  268097.11
1            inss   22979.43   7659.56     30638.99   16478.38   47117.37
2         ac_trab     574.08    191.12       765.20     411.57    1176.77
3            fgts    9191.48   3063.53     12255.01    6591.11   18846.12
4       spprevcom       0.00      0.00         0.00    1154.81    1154.81
5  total_encargos   32744.99  10914.21     43659.20   24635.87   68295.07
6           total  147643.88  49213.54    196857.42  139534.76  336392.18

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.44      -0.47         -0.91       -0.44     -1.35
1            inss  6500.99    2166.77       8667.76       -0.06   8667.70
2         ac_trab   162.49      53.97        216.46       -0.02    216.44
3            fgts  2600.35     866.42       3466.77       -0.02   3466.75
4       spprevcom     0.00       0.00          0.00      253.91    253.91
5  total_encargos  9263.83    3087.16      12350.99      253.81  12604.80
6           total  9263.39    3086.69      12350.08      253.37  12603.45

'------------'

'Cobol'

34328

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  155506.79  51835.55    207342.34  155506.79  362849.13
1            inss   24278.56   8092.81     32371.37   24278.56   56649.93
2         ac_trab    1838.51    612.84      2451.35    1838.51    4289.86
3            fgts    9711.11   3237.09     12948.20    9711.11   22659.31
4       spprevcom       0.00      0.00         0.00    1454.91    1454.91
5  total_encargos   35828.18  11942.74     47770.92   37283.09   85054.01
6           total  191334.97  63778.29    255113.26  192789.88  447903.14

'Java'

34328

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  156736.19  52245.04    208981.23  156736.19  365717.42
1            inss   31346.79  10448.52     41795.31   24524.54   66319.85
2         ac_trab    2373.83    790.87      3164.70    1857.12    5021.82
3            fgts   12538.33   4179.08     16717.41    9809.47   26526.88
4       spprevcom       0.00      0.00         0.00    1767.67    1767.67
5  total_encargos   46258.95  15418.47     61677.42   37958.80   99636.22
6           total  202995.14  67663.51    270658.65  194694.99  465353.64

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao   1229.40     409.49       1638.89     1229.40   2868.29
1            inss   7068.23    2355.71       9423.94      245.98   9669.92
2         ac_trab    535.32     178.03        713.35       18.61    731.96
3            fgts   2827.22     941.99       3769.21       98.36   3867.57
4       spprevcom      0.00       0.00          0.00      312.76    312.76
5  total_encargos  10430.77    3475.73      13906.50      675.71  14582.21
6           total  11660.17    3885.22      15545.39     1905.11  17450.50

'------------'

'Cobol'

34412

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  157775.10  52591.71    210366.81  157775.10  368141.91
1            inss   23524.75   7841.52     31366.27   23524.75   54891.02
2         ac_trab     587.64    195.82       783.46     587.64    1371.10
3            fgts    9409.52   3136.47     12545.99    9409.52   21955.51
4       spprevcom       0.00      0.00         0.00    3046.70    3046.70
5  total_encargos   33521.91  11173.81     44695.72   36568.61   81264.33
6           total  191297.01  63765.52    255062.53  194343.71  449406.24

'Java'

34412

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  157889.02  52629.28    210518.30  157889.02  368407.32
1            inss   31577.39  10525.39     42102.78   23547.60   65650.38
2         ac_trab     788.89    262.58      1051.47     588.15    1639.62
3            fgts   12630.51   4209.79     16840.30    9418.63   26258.93
4       spprevcom       0.00      0.00         0.00    3394.59    3394.59
5  total_encargos   44996.79  14997.76     59994.55   36948.97   96943.52
6           total  202885.81  67627.04    270512.85  194837.99  465350.84

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    113.92      37.57        151.49      113.92    265.41
1            inss   8052.64    2683.87      10736.51       22.85  10759.36
2         ac_trab    201.25      66.76        268.01        0.51    268.52
3            fgts   3220.99    1073.32       4294.31        9.11   4303.42
4       spprevcom      0.00       0.00          0.00      347.89    347.89
5  total_encargos  11474.88    3823.95      15298.83      380.36  15679.19
6           total  11588.80    3861.52      15450.32      494.28  15944.60

'------------'

'Cobol'

34445

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  100753.39  33584.45    134337.84  100753.39  235091.23
1            inss   15919.50   5306.47     21225.97   15919.50   37145.47
2         ac_trab     397.61    132.54       530.15     397.61     927.76
3            fgts    6367.54   2122.50      8490.04    6367.54   14857.58
4       spprevcom       0.00      0.00         0.00    2042.55    2042.55
5  total_encargos   22684.65   7561.51     30246.16   24727.20   54973.36
6           total  123438.04  41145.96    164584.00  125480.59  290064.59

'Java'

34445

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  101288.27  33762.49    135050.76  101288.27  236339.03
1            inss   20257.30   6752.19     27009.49   16026.51   43036.00
2         ac_trab     506.01    168.39       674.40     400.24    1074.64
3            fgts    8102.66   2700.58     10803.24    6410.35   17213.59
4       spprevcom       0.00      0.00         0.00    2106.88    2106.88
5  total_encargos   28865.97   9621.16     38487.13   24943.98   63431.11
6           total  130154.24  43383.65    173537.89  126232.25  299770.14

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao   534.88     178.04        712.92      534.88  1247.80
1            inss  4337.80    1445.72       5783.52      107.01  5890.53
2         ac_trab   108.40      35.85        144.25        2.63   146.88
3            fgts  1735.12     578.08       2313.20       42.81  2356.01
4       spprevcom     0.00       0.00          0.00       64.33    64.33
5  total_encargos  6181.32    2059.65       8240.97      216.78  8457.75
6           total  6716.20    2237.69       8953.89      751.66  9705.55

'------------'

'Cobol'

34447

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  198269.02  66089.69    264358.71  198269.02  462627.73
1            inss   30090.91  10030.27     40121.18   30090.91   70212.09
2         ac_trab     751.70    250.52      1002.22     751.70    1753.92
3            fgts   12036.06   4012.00     16048.06   12036.06   28084.12
4       spprevcom       0.00      0.00         0.00    2138.50    2138.50
5  total_encargos   42878.67  14292.79     57171.46   45017.17  102188.63
6           total  241147.69  80382.48    321530.17  243286.19  564816.36

'Java'

34447

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  198268.36  66089.07    264357.43  198268.36  462625.79
1            inss   39653.19  13217.36     52870.55   30090.80   82961.35
2         ac_trab     990.74    329.82      1320.56     751.68    2072.24
3            fgts   15860.84   5286.53     21147.37   12035.98   33183.35
4       spprevcom       0.00      0.00         0.00    2228.16    2228.16
5  total_encargos   56504.77  18833.71     75338.48   45106.62  120445.10
6           total  254773.13  84922.78    339695.91  243374.98  583070.89

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.66      -0.62         -1.28       -0.66     -1.94
1            inss   9562.28    3187.09      12749.37       -0.11  12749.26
2         ac_trab    239.04      79.30        318.34       -0.02    318.32
3            fgts   3824.78    1274.53       5099.31       -0.08   5099.23
4       spprevcom      0.00       0.00          0.00       89.66     89.66
5  total_encargos  13626.10    4540.92      18167.02       89.45  18256.47
6           total  13625.44    4540.30      18165.74       88.79  18254.53

'------------'

'Cobol'

34451

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  141928.13  47309.39    189237.52  141928.13  331165.65
1            inss   22275.78   7425.23     29701.01   22275.78   51976.79
2         ac_trab     556.49    185.48       741.97     556.49    1298.46
3            fgts    8910.02   2970.02     11880.04    8910.02   20790.06
4       spprevcom       0.00      0.00         0.00    2123.31    2123.31
5  total_encargos   31742.29  10580.73     42323.02   33865.60   76188.62
6           total  173670.42  57890.12    231560.54  175793.73  407354.27

'Java'

34451

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  141927.62  47308.90    189236.52  141927.62  331164.14
1            inss   28385.08   9461.32     37846.40   22275.77   60122.17
2         ac_trab     709.19    236.06       945.25     556.45    1501.70
3            fgts   11353.67   3784.18     15137.85    8909.99   24047.84
4       spprevcom       0.00      0.00         0.00    2367.63    2367.63
5  total_encargos   40447.94  13481.56     53929.50   34109.84   88039.34
6           total  182375.56  60790.46    243166.02  176037.46  419203.48

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.51      -0.49         -1.00       -0.51     -1.51
1            inss  6109.30    2036.09       8145.39       -0.01   8145.38
2         ac_trab   152.70      50.58        203.28       -0.04    203.24
3            fgts  2443.65     814.16       3257.81       -0.03   3257.78
4       spprevcom     0.00       0.00          0.00      244.32    244.32
5  total_encargos  8705.65    2900.83      11606.48      244.24  11850.72
6           total  8705.14    2900.34      11605.48      243.73  11849.21

'------------'

'Cobol'

34459

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  120189.89  40063.29    160253.18  120189.89  280443.07
1            inss   18392.21   6130.70     24522.91   18392.21   42915.12
2         ac_trab     459.43    153.15       612.58     459.43    1072.01
3            fgts    7356.66   2452.22      9808.88    7356.66   17165.54
4       spprevcom       0.00      0.00         0.00    1515.43    1515.43
5  total_encargos   26208.30   8736.07     34944.37   27723.73   62668.10
6           total  146398.19  48799.36    195197.55  147913.62  343111.17

'Java'

34459

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  120189.46  40062.85    160252.31  120189.46  280441.77
1            inss   24037.48   8012.19     32049.67   18392.19   50441.86
2         ac_trab     600.54    199.91       800.45     459.41    1259.86
3            fgts    9614.74   3204.60     12819.34    7356.64   20175.98
4       spprevcom       0.00      0.00         0.00    1637.43    1637.43
5  total_encargos   34252.76  11416.70     45669.46   27845.67   73515.13
6           total  154442.22  51479.55    205921.77  148035.13  353956.90

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.43      -0.44         -0.87       -0.43     -1.30
1            inss  5645.27    1881.49       7526.76       -0.02   7526.74
2         ac_trab   141.11      46.76        187.87       -0.02    187.85
3            fgts  2258.08     752.38       3010.46       -0.02   3010.44
4       spprevcom     0.00       0.00          0.00      122.00    122.00
5  total_encargos  8044.46    2680.63      10725.09      121.94  10847.03
6           total  8044.03    2680.19      10724.22      121.51  10845.73

'------------'

'Cobol'

34461

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  41540.41  13846.80     55387.21   41540.41   96927.62
1            inss   6731.09   2243.67      8974.76    6731.09   15705.85
2         ac_trab    168.07     55.99       224.06     168.07     392.13
3            fgts   2692.30    897.47      3589.77    2692.30    6282.07
4       spprevcom      0.00      0.00         0.00     109.28     109.28
5  total_encargos   9591.46   3197.13     12788.59    9700.74   22489.33
6           total  51131.87  17043.93     68175.80   51241.15  119416.95

'Java'

34461

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  41540.20  13846.58     55386.78   41540.20   96926.98
1            inss   8307.80   2769.13     11076.93    6731.06   17807.99
2         ac_trab    207.43     69.00       276.43     168.05     444.48
3            fgts   3322.93   1107.42      4430.35    2692.29    7122.64
4       spprevcom      0.00      0.00         0.00     196.27     196.27
5  total_encargos  11838.16   3945.55     15783.71    9787.67   25571.38
6           total  53378.36  17792.13     71170.49   51327.87  122498.36

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.21      -0.22         -0.43       -0.21    -0.64
1            inss  1576.71     525.46       2102.17       -0.03  2102.14
2         ac_trab    39.36      13.01         52.37       -0.02    52.35
3            fgts   630.63     209.95        840.58       -0.01   840.57
4       spprevcom     0.00       0.00          0.00       86.99    86.99
5  total_encargos  2246.70     748.42       2995.12       86.93  3082.05
6           total  2246.49     748.20       2994.69       86.72  3081.41

'------------'

'Cobol'

34462

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  219356.06  73118.71    292474.77  219356.06  511830.83
1            inss   34615.31  11538.37     46153.68   34615.31   80768.99
2         ac_trab     864.77    288.18      1152.95     864.77    2017.72
3            fgts   13845.76   4615.33     18461.09   13845.76   32306.85
4       spprevcom       0.00      0.00         0.00    4107.10    4107.10
5  total_encargos   49325.84  16441.88     65767.72   53432.94  119200.66
6           total  268681.90  89560.59    358242.49  272789.00  631031.49

'Java'

34462

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  219355.32  73118.04    292473.36  219355.32  511828.68
1            inss   43870.43  14623.08     58493.51   34615.27   93108.78
2         ac_trab    1096.08    364.98      1461.06     864.73    2325.79
3            fgts   17547.75   5848.71     23396.46   13845.73   37242.19
4       spprevcom       0.00      0.00         0.00    5011.61    5011.61
5  total_encargos   62514.26  20836.77     83351.03   54337.34  137688.37
6           total  281869.58  93954.81    375824.39  273692.66  649517.05

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.74      -0.67         -1.41       -0.74     -2.15
1            inss   9255.12    3084.71      12339.83       -0.04  12339.79
2         ac_trab    231.31      76.80        308.11       -0.04    308.07
3            fgts   3701.99    1233.38       4935.37       -0.03   4935.34
4       spprevcom      0.00       0.00          0.00      904.51    904.51
5  total_encargos  13188.42    4394.89      17583.31      904.40  18487.71
6           total  13187.68    4394.22      17581.90      903.66  18485.56

'------------'

'Cobol'

34463

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  116642.40  38880.81    155523.21  116642.40  272165.61
1            inss   18972.15   6324.07     25296.22   18972.15   44268.37
2         ac_trab     474.00    157.98       631.98     474.00    1105.98
3            fgts    7588.66   2529.57     10118.23    7588.66   17706.89
4       spprevcom       0.00      0.00         0.00    1484.35    1484.35
5  total_encargos   27034.81   9011.62     36046.43   28519.16   64565.59
6           total  143677.21  47892.43    191569.64  145161.56  336731.20

'Java'

34463

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  116856.69  38951.94    155808.63  116856.69  272665.32
1            inss   23370.98   7790.07     31161.05   19015.05   50176.10
2         ac_trab     583.90    194.42       778.32     475.04    1253.36
3            fgts    9348.11   3115.78     12463.89    7605.78   20069.67
4       spprevcom       0.00      0.00         0.00    1720.43    1720.43
5  total_encargos   33302.99  11100.27     44403.26   28816.30   73219.56
6           total  150159.68  50052.21    200211.89  145672.99  345884.88

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao   214.29      71.13        285.42      214.29   499.71
1            inss  4398.83    1466.00       5864.83       42.90  5907.73
2         ac_trab   109.90      36.44        146.34        1.04   147.38
3            fgts  1759.45     586.21       2345.66       17.12  2362.78
4       spprevcom     0.00       0.00          0.00      236.08   236.08
5  total_encargos  6268.18    2088.65       8356.83      297.14  8653.97
6           total  6482.47    2159.78       8642.25      511.43  9153.68

'------------'

'Cobol'

34464

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   84968.36  28322.77    113291.13   84968.36  198259.49
1            inss   12937.16   4312.38     17249.54   12937.16   30186.70
2         ac_trab     323.20    107.76       430.96     323.20     754.16
3            fgts    5174.68   1724.91      6899.59    5174.68   12074.27
4       spprevcom       0.00      0.00         0.00    1580.68    1580.68
5  total_encargos   18435.04   6145.05     24580.09   20015.72   44595.81
6           total  103403.40  34467.82    137871.22  104984.08  242855.30

'Java'

34464

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   84968.00  28322.46    113290.46   84968.00  198258.46
1            inss   16993.36   5664.23     22657.59   12937.16   35594.75
2         ac_trab     424.56    141.32       565.88     323.16     889.04
3            fgts    6797.14   2265.49      9062.63    5174.64   14237.27
4       spprevcom       0.00      0.00         0.00    1620.66    1620.66
5  total_encargos   24215.06   8071.04     32286.10   20055.62   52341.72
6           total  109183.06  36393.50    145576.56  105023.62  250600.18

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.36      -0.31         -0.67       -0.36    -1.03
1            inss  4056.20    1351.85       5408.05        0.00  5408.05
2         ac_trab   101.36      33.56        134.92       -0.04   134.88
3            fgts  1622.46     540.58       2163.04       -0.04  2163.00
4       spprevcom     0.00       0.00          0.00       39.98    39.98
5  total_encargos  5780.02    1925.99       7706.01       39.90  7745.91
6           total  5779.66    1925.68       7705.34       39.54  7744.88

'------------'

'Cobol'

34474

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  137352.41  45784.14    183136.55  137352.41  320488.96
1            inss   20945.93   6981.93     27927.86   20945.93   48873.79
2         ac_trab    1656.54    552.22      2208.76    1656.54    3865.30
3            fgts    8378.11   2792.70     11170.81    8378.11   19548.92
4       spprevcom       0.00      0.00         0.00    2175.82    2175.82
5  total_encargos   30980.58  10326.85     41307.43   33156.40   74463.83
6           total  168332.99  56110.99    224443.98  170508.81  394952.79

'Java'

34474

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  137351.86  45783.58    183135.44  137351.86  320487.30
1            inss   27469.88   9156.28     36626.16   20945.91   57572.07
2         ac_trab    2172.58    723.79      2896.37    1656.49    4552.86
3            fgts   10987.62   3662.18     14649.80    8378.05   23027.85
4       spprevcom       0.00      0.00         0.00    2235.46    2235.46
5  total_encargos   40630.08  13542.25     54172.33   33215.91   87388.24
6           total  177981.94  59325.83    237307.77  170567.77  407875.54

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.55      -0.56         -1.11       -0.55     -1.66
1            inss  6523.95    2174.35       8698.30       -0.02   8698.28
2         ac_trab   516.04     171.57        687.61       -0.05    687.56
3            fgts  2609.51     869.48       3478.99       -0.06   3478.93
4       spprevcom     0.00       0.00          0.00       59.64     59.64
5  total_encargos  9649.50    3215.40      12864.90       59.51  12924.41
6           total  9648.95    3214.84      12863.79       58.96  12922.75

'------------'

'Cobol'

34475

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  60133.80  20044.61     80178.41   60133.80  140312.21
1            inss   9992.00   3330.66     13322.66    9992.00   23314.66
2         ac_trab    892.66    297.54      1190.20     892.66    2082.86
3            fgts   3996.64   1332.22      5328.86    3996.64    9325.50
4       spprevcom      0.00      0.00         0.00     549.05     549.05
5  total_encargos  14881.30   4960.42     19841.72   15430.35   35272.07
6           total  75015.10  25005.03    100020.13   75564.15  175584.28

'Java'

34475

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  60133.58  20044.36     80177.94   60133.58  140311.52
1            inss  12026.48   4008.66     16035.14    9991.98   26027.12
2         ac_trab   1074.44    357.95      1432.39     892.65    2325.04
3            fgts   4810.46   1603.31      6413.77    3996.63   10410.40
4       spprevcom      0.00      0.00         0.00     718.24     718.24
5  total_encargos  17911.38   5969.92     23881.30   15599.50   39480.80
6           total  78044.96  26014.28    104059.24   75733.08  179792.32

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.22      -0.25         -0.47       -0.22    -0.69
1            inss  2034.48     678.00       2712.48       -0.02  2712.46
2         ac_trab   181.78      60.41        242.19       -0.01   242.18
3            fgts   813.82     271.09       1084.91       -0.01  1084.90
4       spprevcom     0.00       0.00          0.00      169.19   169.19
5  total_encargos  3030.08    1009.50       4039.58      169.15  4208.73
6           total  3029.86    1009.25       4039.11      168.93  4208.04

'------------'

'Cobol'

34646

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  186414.30  62138.11    248552.41  186414.30  434966.71
1            inss   30964.25  10321.41     41285.66   30964.25   72249.91
2         ac_trab     773.40    257.76      1031.16     773.40    1804.56
3            fgts   12385.29   4128.46     16513.75   12385.29   28899.04
4       spprevcom       0.00      0.00         0.00    2875.54    2875.54
5  total_encargos   44122.94  14707.63     58830.57   46998.48  105829.05
6           total  230537.24  76845.74    307382.98  233412.78  540795.76

'Java'

34646

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  187615.35  62537.94    250153.29  187615.35  437768.64
1            inss   37522.41  12507.01     50029.42   31135.89   81165.31
2         ac_trab     937.31    311.89      1249.20     777.67    2026.87
3            fgts   15008.41   5002.30     20010.71   12453.91   32464.62
4       spprevcom       0.00      0.00         0.00    3379.55    3379.55
5  total_encargos   53468.13  17821.20     71289.33   47747.02  119036.35
6           total  241083.48  80359.14    321442.62  235362.37  556804.99

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao   1201.05     399.83       1600.88     1201.05   2801.93
1            inss   6558.16    2185.60       8743.76      171.64   8915.40
2         ac_trab    163.91      54.13        218.04        4.27    222.31
3            fgts   2623.12     873.84       3496.96       68.62   3565.58
4       spprevcom      0.00       0.00          0.00      504.01    504.01
5  total_encargos   9345.19    3113.57      12458.76      748.54  13207.30
6           total  10546.24    3513.40      14059.64     1949.59  16009.23

'------------'

'Cobol'

34647

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   93553.37  31184.49    124737.86   93553.37  218291.23
1            inss   14649.46   4883.15     19532.61   14649.46   34182.07
2         ac_trab     365.88    121.95       487.83     365.88     853.71
3            fgts    5859.50   1953.15      7812.65    5859.50   13672.15
4       spprevcom       0.00      0.00         0.00    1178.06    1178.06
5  total_encargos   20874.84   6958.25     27833.09   22052.90   49885.99
6           total  114428.21  38142.74    152570.95  115606.27  268177.22

'Java'

34647

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   94930.57  31643.24    126573.81   94930.57  221504.38
1            inss   18985.75   6328.29     25314.04   14878.36   40192.40
2         ac_trab     474.23    157.76       631.99     371.57    1003.56
3            fgts    7593.98   2531.04     10125.02    5951.03   16076.05
4       spprevcom       0.00      0.00         0.00    1525.55    1525.55
5  total_encargos   27053.96   9017.09     36071.05   22726.51   58797.56
6           total  121984.53  40660.33    162644.86  117657.08  280301.94

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao  1377.20     458.75       1835.95     1377.20   3213.15
1            inss  4336.29    1445.14       5781.43      228.90   6010.33
2         ac_trab   108.35      35.81        144.16        5.69    149.85
3            fgts  1734.48     577.89       2312.37       91.53   2403.90
4       spprevcom     0.00       0.00          0.00      347.49    347.49
5  total_encargos  6179.12    2058.84       8237.96      673.61   8911.57
6           total  7556.32    2517.59      10073.91     2050.81  12124.72

'------------'

'Cobol'

34648

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  142047.86  47349.26    189397.12  142047.86  331444.98
1            inss   21469.55   7156.52     28626.07   21469.55   50095.62
2         ac_trab     536.20    178.74       714.94     536.20    1251.14
3            fgts    8587.43   2862.50     11449.93    8587.43   20037.36
4       spprevcom       0.00      0.00         0.00    2161.05    2161.05
5  total_encargos   30593.18  10197.76     40790.94   32754.23   73545.17
6           total  172641.04  57547.02    230188.06  174802.09  404990.15

'Java'

34648

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  143506.02  47834.97    191340.99  143506.02  334847.01
1            inss   28700.79   9566.55     38267.34   21695.45   59962.79
2         ac_trab     716.94    238.61       955.55     541.81    1497.36
3            fgts   11479.95   3826.29     15306.24    8677.77   23984.01
4       spprevcom       0.00      0.00         0.00    2522.46    2522.46
5  total_encargos   40897.68  13631.45     54529.13   33437.49   87966.62
6           total  184403.70  61466.42    245870.12  176943.51  422813.63

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao   1458.16     485.71       1943.87     1458.16   3402.03
1            inss   7231.24    2410.03       9641.27      225.90   9867.17
2         ac_trab    180.74      59.87        240.61        5.61    246.22
3            fgts   2892.52     963.79       3856.31       90.34   3946.65
4       spprevcom      0.00       0.00          0.00      361.41    361.41
5  total_encargos  10304.50    3433.69      13738.19      683.26  14421.45
6           total  11762.66    3919.40      15682.06     2141.42  17823.48

'------------'

'Cobol'

34649

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  170719.47  56906.47    227625.94  170719.47  398345.41
1            inss   26323.05   8774.30     35097.35   26323.05   61420.40
2         ac_trab     657.61    219.18       876.79     657.61    1534.40
3            fgts   10529.00   3509.72     14038.72   10529.00   24567.72
4       spprevcom       0.00      0.00         0.00    3130.36    3130.36
5  total_encargos   37509.66  12503.20     50012.86   40640.02   90652.88
6           total  208229.13  69409.67    277638.80  211359.49  488998.29

'Java'

34649

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  170718.80  56905.93    227624.73  170718.80  398343.53
1            inss   34143.27  11380.72     45523.99   26323.03   71847.02
2         ac_trab     853.11    284.01      1137.12     657.56    1794.68
3            fgts   13656.94   4551.90     18208.84   10528.93   28737.77
4       spprevcom       0.00      0.00         0.00    3428.84    3428.84
5  total_encargos   48653.32  16216.63     64869.95   40938.36  105808.31
6           total  219372.12  73122.56    292494.68  211657.16  504151.84

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.67      -0.54         -1.21       -0.67     -1.88
1            inss   7820.22    2606.42      10426.64       -0.02  10426.62
2         ac_trab    195.50      64.83        260.33       -0.05    260.28
3            fgts   3127.94    1042.18       4170.12       -0.07   4170.05
4       spprevcom      0.00       0.00          0.00      298.48    298.48
5  total_encargos  11143.66    3713.43      14857.09      298.34  15155.43
6           total  11142.99    3712.89      14855.88      297.67  15153.55

'------------'

'Cobol'

34650

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  46096.19  15365.41     61461.60   46096.19  107557.79
1            inss   7746.56   2582.17     10328.73    7746.56   18075.29
2         ac_trab    193.42     64.47       257.89     193.42     451.31
3            fgts   3098.46   1032.83      4131.29    3098.46    7229.75
4       spprevcom      0.00      0.00         0.00     173.05     173.05
5  total_encargos  11038.44   3679.47     14717.91   11211.49   25929.40
6           total  57134.63  19044.88     76179.51   57307.68  133487.19

'Java'

34650

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  46980.60  15659.96     62640.56   46980.60  109621.16
1            inss   9395.88   3131.79     12527.67    7923.49   20451.16
2         ac_trab    234.62     77.99       312.61     197.80     510.41
3            fgts   3758.17   1252.49      5010.66    3169.22    8179.88
4       spprevcom      0.00      0.00         0.00     222.33     222.33
5  total_encargos  13388.67   4462.27     17850.94   11512.84   29363.78
6           total  60369.27  20122.23     80491.50   58493.44  138984.94

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao   884.41     294.55       1178.96      884.41  2063.37
1            inss  1649.32     549.62       2198.94      176.93  2375.87
2         ac_trab    41.20      13.52         54.72        4.38    59.10
3            fgts   659.71     219.66        879.37       70.76   950.13
4       spprevcom     0.00       0.00          0.00       49.28    49.28
5  total_encargos  2350.23     782.80       3133.03      301.35  3434.38
6           total  3234.64    1077.35       4311.99     1185.76  5497.75

'------------'

'Cobol'

34720

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  196287.70  65429.23    261716.93  196287.70  458004.63
1            inss   30611.71  10203.91     40815.62   30611.71   71427.33
2         ac_trab     764.57    254.78      1019.35     764.57    1783.92
3            fgts   12244.23   4081.42     16325.65   12244.23   28569.88
4       spprevcom       0.00      0.00         0.00    3193.60    3193.60
5  total_encargos   43620.51  14540.11     58160.62   46814.11  104974.73
6           total  239908.21  79969.34    319877.55  243101.81  562979.36

'Java'

34720

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  196286.92  65428.51    261715.43  196286.92  458002.35
1            inss   39256.74  13085.05     52341.79   30611.68   82953.47
2         ac_trab     980.68    326.39      1307.07     764.51    2071.58
3            fgts   15702.19   5233.50     20935.69   12244.19   33179.88
4       spprevcom       0.00      0.00         0.00    3237.11    3237.11
5  total_encargos   55939.61  18644.94     74584.55   46857.49  121442.04
6           total  252226.53  84073.45    336299.98  243144.41  579444.39

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.78      -0.72         -1.50       -0.78     -2.28
1            inss   8645.03    2881.14      11526.17       -0.03  11526.14
2         ac_trab    216.11      71.61        287.72       -0.06    287.66
3            fgts   3457.96    1152.08       4610.04       -0.04   4610.00
4       spprevcom      0.00       0.00          0.00       43.51     43.51
5  total_encargos  12319.10    4104.83      16423.93       43.38  16467.31
6           total  12318.32    4104.11      16422.43       42.60  16465.03

'------------'

'Cobol'

34874

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  238536.39  79512.20    318048.59  238536.39  556584.98
1            inss   34774.90  11591.58     46366.48   34774.90   81141.38
2         ac_trab     868.79    289.58      1158.37     868.79    2027.16
3            fgts   13909.57   4636.51     18546.08   13909.57   32455.65
4       spprevcom       0.00      0.00         0.00    4594.01    4594.01
5  total_encargos   49553.26  16517.67     66070.93   54147.27  120218.20
6           total  288089.65  96029.87    384119.52  292683.66  676803.18

'Java'

34874

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario      total
0     apropriacao  239437.73   79812.10    319249.83  239437.73  558687.56
1            inss   47886.99   15961.85     63848.84   34955.25   98804.09
2         ac_trab    1196.50     398.38      1594.88     873.24    2468.12
3            fgts   19154.36    6384.27     25538.63   13981.65   39520.28
4       spprevcom       0.00       0.00         0.00    4993.09    4993.09
5  total_encargos   68237.85   22744.50     90982.35   54803.23  145785.58
6           total  307675.58  102556.60    410232.18  294240.96  704473.14

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    901.34     299.90       1201.24      901.34   2102.58
1            inss  13112.09    4370.27      17482.36      180.35  17662.71
2         ac_trab    327.71     108.80        436.51        4.45    440.96
3            fgts   5244.79    1747.76       6992.55       72.08   7064.63
4       spprevcom      0.00       0.00          0.00      399.08    399.08
5  total_encargos  18684.59    6226.83      24911.42      655.96  25567.38
6           total  19585.93    6526.73      26112.66     1557.30  27669.96

'------------'

'Cobol'

34895

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  143953.51  47984.41    191937.92  143953.51  335891.43
1            inss   24728.97   8242.96     32971.93   24728.97   57700.90
2         ac_trab    1697.52    565.78      2263.30    1697.52    3960.82
3            fgts    9891.21   3297.02     13188.23    9891.21   23079.44
4       spprevcom       0.00      0.00         0.00    2316.27    2316.27
5  total_encargos   36317.70  12105.76     48423.46   38633.97   87057.43
6           total  180271.21  60090.17    240361.38  182587.48  422948.86

'Java'

34895

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  143952.90  47983.89    191936.79  143952.90  335889.69
1            inss   28789.97   9596.24     38386.21   24728.90   63115.11
2         ac_trab    1976.30    658.33      2634.63    1697.41    4332.04
3            fgts   11515.51   3838.07     15353.58    9891.15   25244.73
4       spprevcom       0.00      0.00         0.00    2661.65    2661.65
5  total_encargos   42281.78  14092.64     56374.42   38979.11   95353.53
6           total  186234.68  62076.53    248311.21  182932.01  431243.22

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.61      -0.52         -1.13       -0.61    -1.74
1            inss  4061.00    1353.28       5414.28       -0.07  5414.21
2         ac_trab   278.78      92.55        371.33       -0.11   371.22
3            fgts  1624.30     541.05       2165.35       -0.06  2165.29
4       spprevcom     0.00       0.00          0.00      345.38   345.38
5  total_encargos  5964.08    1986.88       7950.96      345.14  8296.10
6           total  5963.47    1986.36       7949.83      344.53  8294.36

'------------'

'Cobol'

34950

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  81390.47  27130.18    108520.65   81390.47  189911.12
1            inss  12837.22   4279.03     17116.25   12837.22   29953.47
2         ac_trab    320.65    106.85       427.50     320.65     748.15
3            fgts   5134.72   1711.59      6846.31    5134.72   11981.03
4       spprevcom      0.00      0.00         0.00    1286.12    1286.12
5  total_encargos  18292.59   6097.47     24390.06   19578.71   43968.77
6           total  99683.06  33227.65    132910.71  100969.18  233879.89

'Java'

34950

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   81390.26  27129.90    108520.16   81390.26  189910.42
1            inss   16277.77   5425.74     21703.51   12837.20   34540.71
2         ac_trab     406.67    135.36       542.03     320.64     862.67
3            fgts    6510.93   2170.11      8681.04    5134.71   13815.75
4       spprevcom       0.00      0.00         0.00    1697.57    1697.57
5  total_encargos   23195.37   7731.21     30926.58   19990.12   50916.70
6           total  104585.63  34861.11    139446.74  101380.38  240827.12

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.21      -0.28         -0.49       -0.21    -0.70
1            inss  3440.55    1146.71       4587.26       -0.02  4587.24
2         ac_trab    86.02      28.51        114.53       -0.01   114.52
3            fgts  1376.21     458.52       1834.73       -0.01  1834.72
4       spprevcom     0.00       0.00          0.00      411.45   411.45
5  total_encargos  4902.78    1633.74       6536.52      411.41  6947.93
6           total  4902.57    1633.46       6536.03      411.20  6947.23

'------------'

'Cobol'

40434

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario       total
0     apropriacao  360940.90  120313.76    481254.66  360940.90   842195.56
1            inss   61317.13   20439.04     81756.17   61317.13   143073.30
2         ac_trab    1531.42     510.10      2041.52    1531.42     3572.94
3            fgts   24526.11    8175.33     32701.44   24526.11    57227.55
4       spprevcom       0.00       0.00         0.00    1668.03     1668.03
5  total_encargos   87374.66   29124.47    116499.13   89042.69   205541.82
6           total  448315.56  149438.23    597753.79  449983.59  1047737.38

'Java'

40434

'clt'

'apropriado'

                      ferias  13_ferias total_ferias 13_salario       total
0     apropriacao  364641.26  121545.68    486186.94  364641.26   850828.20
1            inss   72926.76   24308.00     97234.76   62057.50   159292.26
2         ac_trab    1821.50     605.96      2427.46    1549.83     3977.29
3            fgts   29169.32    9721.89     38891.21   24822.20    63713.41
4       spprevcom       0.00       0.00         0.00    1959.04     1959.04
5  total_encargos  103917.58   34635.85    138553.43   90388.57   228942.00
6           total  468558.84  156181.53    624740.37  455029.83  1079770.20

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao   3700.36    1231.92       4932.28     3700.36   8632.64
1            inss  11609.63    3868.96      15478.59      740.37  16218.96
2         ac_trab    290.08      95.86        385.94       18.41    404.35
3            fgts   4643.21    1546.56       6189.77      296.09   6485.86
4       spprevcom      0.00       0.00          0.00      291.01    291.01
5  total_encargos  16542.92    5511.38      22054.30     1345.88  23400.18
6           total  20243.28    6743.30      26986.58     5046.24  32032.82

'------------'

'Cobol'

40435

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  57536.94  19179.00     76715.94   57536.94  134252.88
1            inss   9005.41   3001.76     12007.17    9005.41   21012.58
2         ac_trab    224.92     74.99       299.91     224.92     524.83
3            fgts   3602.03   1200.71      4802.74    3602.03    8404.77
4       spprevcom      0.00      0.00         0.00     451.18     451.18
5  total_encargos  12832.36   4277.46     17109.82   13283.54   30393.36
6           total  70369.30  23456.46     93825.76   70820.48  164646.24

'Java'

40435

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  57536.61  19178.72     76715.33   57536.61  134251.94
1            inss  11507.09   3835.54     15342.63    9005.40   24348.03
2         ac_trab    287.45     95.65       383.10     224.91     608.01
3            fgts   4602.62   1534.01      6136.63    3602.01    9738.64
4       spprevcom      0.00      0.00         0.00     514.18     514.18
5  total_encargos  16397.16   5465.20     21862.36   13346.50   35208.86
6           total  73933.77  24643.92     98577.69   70883.11  169460.80

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.33      -0.28         -0.61       -0.33    -0.94
1            inss  2501.68     833.78       3335.46       -0.01  3335.45
2         ac_trab    62.53      20.66         83.19       -0.01    83.18
3            fgts  1000.59     333.30       1333.89       -0.02  1333.87
4       spprevcom     0.00       0.00          0.00       63.00    63.00
5  total_encargos  3564.80    1187.74       4752.54       62.96  4815.50
6           total  3564.47    1187.46       4751.93       62.63  4814.56

'------------'

'Cobol'

40436

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   98669.63  32889.86    131559.49   98669.63  230229.12
1            inss   14565.93   4855.28     19421.21   14565.93   33987.14
2         ac_trab    1305.08    435.05      1740.13    1305.08    3045.21
3            fgts    5826.18   1942.11      7768.29    5826.18   13594.47
4       spprevcom       0.00      0.00         0.00    1655.63    1655.63
5  total_encargos   21697.19   7232.44     28929.63   23352.82   52282.45
6           total  120366.82  40122.30    160489.12  122022.45  282511.57

'Java'

40436

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   98669.25  32889.58    131558.83   98669.25  230228.08
1            inss   19733.56   6577.63     26311.19   14565.91   40877.10
2         ac_trab    1768.18    589.15      2357.33    1305.07    3662.40
3            fgts    7893.23   2630.78     10524.01    5826.17   16350.18
4       spprevcom       0.00      0.00         0.00    1782.31    1782.31
5  total_encargos   29394.97   9797.56     39192.53   23479.46   62671.99
6           total  128064.22  42687.14    170751.36  122148.71  292900.07

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.38      -0.28         -0.66       -0.38     -1.04
1            inss  5167.63    1722.35       6889.98       -0.02   6889.96
2         ac_trab   463.10     154.10        617.20       -0.01    617.19
3            fgts  2067.05     688.67       2755.72       -0.01   2755.71
4       spprevcom     0.00       0.00          0.00      126.68    126.68
5  total_encargos  7697.78    2565.12      10262.90      126.64  10389.54
6           total  7697.40    2564.84      10262.24      126.26  10388.50

'------------'

'Cobol'

40437

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   87749.91  29249.94    116999.85   87749.91  204749.76
1            inss   12930.61   4310.17     17240.78   12930.61   30171.39
2         ac_trab     323.01    107.65       430.66     323.01     753.67
3            fgts    5172.05   1724.01      6896.06    5172.05   12068.11
4       spprevcom       0.00      0.00         0.00    1380.74    1380.74
5  total_encargos   18425.67   6141.83     24567.50   19806.41   44373.91
6           total  106175.58  35391.77    141567.35  107556.32  249123.67

'Java'

40437

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   87749.67  29249.77    116999.44   87749.67  204749.11
1            inss   17549.67   5849.70     23399.37   12930.60   36329.97
2         ac_trab     438.47    145.98       584.45     322.98     907.43
3            fgts    7019.69   2339.69      9359.38    5172.05   14531.43
4       spprevcom       0.00      0.00         0.00    1509.51    1509.51
5  total_encargos   25007.83   8335.37     33343.20   19935.14   53278.34
6           total  112757.50  37585.14    150342.64  107684.81  258027.45

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.24      -0.17         -0.41       -0.24    -0.65
1            inss  4619.06    1539.53       6158.59       -0.01  6158.58
2         ac_trab   115.46      38.33        153.79       -0.03   153.76
3            fgts  1847.64     615.68       2463.32        0.00  2463.32
4       spprevcom     0.00       0.00          0.00      128.77   128.77
5  total_encargos  6582.16    2193.54       8775.70      128.73  8904.43
6           total  6581.92    2193.37       8775.29      128.49  8903.78

'------------'

'Cobol'

40438

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  60733.94  20244.64     80978.58   60733.94  141712.52
1            inss   8853.33   2951.12     11804.45    8853.33   20657.78
2         ac_trab    221.18     73.69       294.87     221.18     516.05
3            fgts   3541.24   1180.41      4721.65    3541.24    8262.89
4       spprevcom      0.00      0.00         0.00    1111.61    1111.61
5  total_encargos  12615.75   4205.22     16820.97   13727.36   30548.33
6           total  73349.69  24449.86     97799.55   74461.30  172260.85

'Java'

40438

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  60733.80  20244.47     80978.27   60733.80  141712.07
1            inss  12146.58   4048.72     16195.30    8853.33   25048.63
2         ac_trab    303.48    101.06       404.54     221.17     625.71
3            fgts   4858.52   1619.36      6477.88    3541.22   10019.10
4       spprevcom      0.00      0.00         0.00    1211.73    1211.73
5  total_encargos  17308.58   5769.14     23077.72   13827.45   36905.17
6           total  78042.38  26013.61    104055.99   74561.25  178617.24

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.14      -0.17         -0.31       -0.14    -0.45
1            inss  3293.25    1097.60       4390.85        0.00  4390.85
2         ac_trab    82.30      27.37        109.67       -0.01   109.66
3            fgts  1317.28     438.95       1756.23       -0.02  1756.21
4       spprevcom     0.00       0.00          0.00      100.12   100.12
5  total_encargos  4692.83    1563.92       6256.75      100.09  6356.84
6           total  4692.69    1563.75       6256.44       99.95  6356.39

'------------'

'Cobol'

40439

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  113603.77  37867.95    151471.72  113603.77  265075.49
1            inss   16240.81   5413.58     21654.39   16240.81   37895.20
2         ac_trab     405.67    135.24       540.91     405.67     946.58
3            fgts    6496.09   2165.36      8661.45    6496.09   15157.54
4       spprevcom       0.00      0.00         0.00    2141.32    2141.32
5  total_encargos   23142.57   7714.18     30856.75   25283.89   56140.64
6           total  136746.34  45582.13    182328.47  138887.66  321216.13

'Java'

40439

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  113603.32  37867.49    151470.81  113603.32  265074.13
1            inss   22720.37   7573.23     30293.60   16240.79   46534.39
2         ac_trab     567.67    188.96       756.63     405.65    1162.28
3            fgts    9087.91   3029.07     12116.98    6496.04   18613.02
4       spprevcom       0.00      0.00         0.00    2346.59    2346.59
5  total_encargos   32375.95  10791.26     43167.21   25489.07   68656.28
6           total  145979.27  48658.75    194638.02  139092.39  333730.41

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.45      -0.46         -0.91       -0.45     -1.36
1            inss  6479.56    2159.65       8639.21       -0.02   8639.19
2         ac_trab   162.00      53.72        215.72       -0.02    215.70
3            fgts  2591.82     863.71       3455.53       -0.05   3455.48
4       spprevcom     0.00       0.00          0.00      205.27    205.27
5  total_encargos  9233.38    3077.08      12310.46      205.18  12515.64
6           total  9232.93    3076.62      12309.55      204.73  12514.28

'------------'

'Cobol'

40440

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   89007.58  29669.20    118676.78   89007.58  207684.36
1            inss   12820.43   4273.48     17093.91   12820.43   29914.34
2         ac_trab     320.28    106.77       427.05     320.28     747.33
3            fgts    5128.02   1709.35      6837.37    5128.02   11965.39
4       spprevcom       0.00      0.00         0.00    1302.08    1302.08
5  total_encargos   18268.73   6089.60     24358.33   19570.81   43929.14
6           total  107276.31  35758.80    143035.11  108578.39  251613.50

'Java'

40440

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   89007.21  29668.88    118676.09   89007.21  207683.30
1            inss   17801.19   5933.53     23734.72   12820.42   36555.14
2         ac_trab     444.75    147.99       592.74     320.25     912.99
3            fgts    7120.30   2373.22      9493.52    5127.98   14621.50
4       spprevcom       0.00      0.00         0.00    1446.52    1446.52
5  total_encargos   25366.24   8454.74     33820.98   19715.17   53536.15
6           total  114373.45  38123.62    152497.07  108722.38  261219.45

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.37      -0.32         -0.69       -0.37    -1.06
1            inss  4980.76    1660.05       6640.81       -0.01  6640.80
2         ac_trab   124.47      41.22        165.69       -0.03   165.66
3            fgts  1992.28     663.87       2656.15       -0.04  2656.11
4       spprevcom     0.00       0.00          0.00      144.44   144.44
5  total_encargos  7097.51    2365.14       9462.65      144.36  9607.01
6           total  7097.14    2364.82       9461.96      143.99  9605.95

'------------'

'Cobol'

40441

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  142959.24  47653.09    190612.33  142959.24  333571.57
1            inss   19488.01   6495.98     25983.99   19488.01   45472.00
2         ac_trab     486.97    162.34       649.31     486.97    1136.28
3            fgts    7794.98   2598.33     10393.31    7794.98   18188.29
4       spprevcom       0.00      0.00         0.00    3006.67    3006.67
5  total_encargos   27769.96   9256.65     37026.61   30776.63   67803.24
6           total  170729.20  56909.74    227638.94  173735.87  401374.81

'Java'

40441

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  142958.93  47652.74    190611.67  142958.93  333570.60
1            inss   28591.54   9530.26     38121.80   19487.99   57609.79
2         ac_trab     714.47    237.91       952.38     486.91    1439.29
3            fgts   11436.38   3811.89     15248.27    7794.95   23043.22
4       spprevcom       0.00      0.00         0.00    3185.80    3185.80
5  total_encargos   40742.39  13580.06     54322.45   30955.65   85278.10
6           total  183701.32  61232.80    244934.12  173914.58  418848.70

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao     -0.31      -0.35         -0.66       -0.31     -0.97
1            inss   9103.53    3034.28      12137.81       -0.02  12137.79
2         ac_trab    227.50      75.57        303.07       -0.06    303.01
3            fgts   3641.40    1213.56       4854.96       -0.03   4854.93
4       spprevcom      0.00       0.00          0.00      179.13    179.13
5  total_encargos  12972.43    4323.41      17295.84      179.02  17474.86
6           total  12972.12    4323.06      17295.18      178.71  17473.89

'------------'

'Cobol'

40442

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  119186.58  39728.84    158915.42  119186.58  278102.00
1            inss   18500.27   6166.71     24666.98   18500.27   43167.25
2         ac_trab     462.14    154.09       616.23     462.14    1078.37
3            fgts    7399.85   2466.63      9866.48    7399.85   17266.33
4       spprevcom       0.00      0.00         0.00    2650.07    2650.07
5  total_encargos   26362.26   8787.43     35149.69   29012.33   64162.02
6           total  145548.84  48516.27    194065.11  148198.91  342264.02

'Java'

40442

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  119186.25  39728.52    158914.77  119186.25  278101.02
1            inss   23836.87   7945.40     31782.27   18500.25   50282.52
2         ac_trab     595.53    198.22       793.75     462.11    1255.86
3            fgts    9534.48   3177.90     12712.38    7399.84   20112.22
4       spprevcom       0.00      0.00         0.00    2777.31    2777.31
5  total_encargos   33966.88  11321.52     45288.40   29139.51   74427.91
6           total  153153.13  51050.04    204203.17  148325.76  352528.93

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    -0.33      -0.32         -0.65       -0.33     -0.98
1            inss  5336.60    1778.69       7115.29       -0.02   7115.27
2         ac_trab   133.39      44.13        177.52       -0.03    177.49
3            fgts  2134.63     711.27       2845.90       -0.01   2845.89
4       spprevcom     0.00       0.00          0.00      127.24    127.24
5  total_encargos  7604.62    2534.09      10138.71      127.18  10265.89
6           total  7604.29    2533.77      10138.06      126.85  10264.91

'------------'

'Cobol'

40443

'clt'

'apropriado'

                     ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  81855.66  27285.25    109140.91   81855.66  190996.57
1            inss  11815.18   3938.40     15753.58   11815.18   27568.76
2         ac_trab    295.09     98.33       393.42     295.09     688.51
3            fgts   4725.95   1575.35      6301.30    4725.95   11027.25
4       spprevcom      0.00      0.00         0.00    1408.12    1408.12
5  total_encargos  16836.22   5612.08     22448.30   18244.34   40692.64
6           total  98691.88  32897.33    131589.21  100100.00  231689.21

'Java'

40443

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao   81855.40  27284.96    109140.36   81855.40  190995.76
1            inss   16370.84   5456.75     21827.59   11815.16   33642.75
2         ac_trab     409.04    136.19       545.23     295.09     840.32
3            fgts    6548.16   2182.49      8730.65    4725.93   13456.58
4       spprevcom       0.00      0.00         0.00    1427.97    1427.97
5  total_encargos   23328.04   7775.43     31103.47   18264.15   49367.62
6           total  105183.44  35060.39    140243.83  100119.55  240363.38

'diferenca: (java) - (cobol)'

                    ferias  13_ferias  total_ferias  13_salario    total
0     apropriacao    -0.26      -0.29         -0.55       -0.26    -0.81
1            inss  4555.66    1518.35       6074.01       -0.02  6073.99
2         ac_trab   113.95      37.86        151.81        0.00   151.81
3            fgts  1822.21     607.14       2429.35       -0.02  2429.33
4       spprevcom     0.00       0.00          0.00       19.85    19.85
5  total_encargos  6491.82    2163.35       8655.17       19.81  8674.98
6           total  6491.56    2163.06       8654.62       19.55  8674.17

'------------'

'Cobol'

99998

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  189086.18  63028.79    252114.97  189086.18  441201.15
1            inss   28138.69   9379.50     37518.19   28138.69   65656.88
2         ac_trab     702.74    234.26       937.00     702.74    1639.74
3            fgts   11255.03   3751.66     15006.69   11255.03   26261.72
4       spprevcom       0.00      0.00         0.00    2598.55    2598.55
5  total_encargos   40096.46  13365.42     53461.88   42695.01   96156.89
6           total  229182.64  76394.21    305576.85  231781.19  537358.04

'Java'

99998

'clt'

'apropriado'

                      ferias 13_ferias total_ferias 13_salario      total
0     apropriacao  189514.62  63171.04    252685.66  189514.62  442200.28
1            inss   37902.34  12633.60     50535.94   28224.50   78760.44
2         ac_trab     946.83    315.06      1261.89     704.83    1966.72
3            fgts   15160.42   5053.00     20213.42   11289.33   31502.75
4       spprevcom       0.00      0.00         0.00    3096.77    3096.77
5  total_encargos   54009.59  18001.66     72011.25   43315.43  115326.68
6           total  243524.21  81172.70    324696.91  232830.05  557526.96

'diferenca: (java) - (cobol)'

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao    428.44     142.25        570.69      428.44    999.13
1            inss   9763.65    3254.10      13017.75       85.81  13103.56
2         ac_trab    244.09      80.80        324.89        2.09    326.98
3            fgts   3905.39    1301.34       5206.73       34.30   5241.03
4       spprevcom      0.00       0.00          0.00      498.22    498.22
5  total_encargos  13913.13    4636.24      18549.37      620.42  19169.79
6           total  14341.57    4778.49      19120.06     1048.86  20168.92

'------------'

In [8]:
code = 40434

# display("cobol", "clt")
display("apropriado", cobol_report[code]['clt']['apropriado'])
# display("realizado", cobol[code]['clt']['realizado'])
# display("autarquico")
# display("apropriado", cobol[code]['autarquico']['apropriado'])
# display("realizado", cobol[code]['autarquico']['realizado'])
# display("java", "clt")
display("apropriado", java_report[code]['clt']['apropriado'])
# display("realizado", java[code]['clt']['realizado'])
# display("autarquico")
# display("apropriado", java[code]['autarquico']['apropriado'])
# display("realizado", java[code]['autarquico']['realizado'])

items = java_report[code]['clt']['apropriado'].iloc[:,0]
df1 = java_report[code]['clt']['apropriado'].iloc[:,1:].apply(pd.to_numeric, errors='coerce')
df2 = cobol_report[code]['clt']['apropriado'].iloc[:,1:].apply(pd.to_numeric, errors='coerce')

df3 = df1 - df2
df3 = pd.concat([items, df3], axis=1)

display(df3)

'apropriado'

                      ferias  13_ferias total_ferias 13_salario       total
0     apropriacao  360940.90  120313.76    481254.66  360940.90   842195.56
1            inss   61317.13   20439.04     81756.17   61317.13   143073.30
2         ac_trab    1531.42     510.10      2041.52    1531.42     3572.94
3            fgts   24526.11    8175.33     32701.44   24526.11    57227.55
4       spprevcom       0.00       0.00         0.00    1668.03     1668.03
5  total_encargos   87374.66   29124.47    116499.13   89042.69   205541.82
6           total  448315.56  149438.23    597753.79  449983.59  1047737.38

'apropriado'

                      ferias  13_ferias total_ferias 13_salario       total
0     apropriacao  364641.26  121545.68    486186.94  364641.26   850828.20
1            inss   72926.76   24308.00     97234.76   62057.50   159292.26
2         ac_trab    1821.50     605.96      2427.46    1549.83     3977.29
3            fgts   29169.32    9721.89     38891.21   24822.20    63713.41
4       spprevcom       0.00       0.00         0.00    1959.04     1959.04
5  total_encargos  103917.58   34635.85    138553.43   90388.57   228942.00
6           total  468558.84  156181.53    624740.37  455029.83  1079770.20

                     ferias  13_ferias  total_ferias  13_salario     total
0     apropriacao   3700.36    1231.92       4932.28     3700.36   8632.64
1            inss  11609.63    3868.96      15478.59      740.37  16218.96
2         ac_trab    290.08      95.86        385.94       18.41    404.35
3            fgts   4643.21    1546.56       6189.77      296.09   6485.86
4       spprevcom      0.00       0.00          0.00      291.01    291.01
5  total_encargos  16542.92    5511.38      22054.30     1345.88  23400.18
6           total  20243.28    6743.30      26986.58     5046.24  32032.82